


class предмети:
    pass


class неживі(предмети):
    pass


class тротуар(неживі):
    pass


class живі(предмети):
    pass


class тварини(живі):
    def дихати(self):
        print('дихає')
    def рухатися(self):
        print('рухається')
    def харчувати_їжею(self):
        print('харчуєтся їжею')

        
class ссавці(тварини):
    def годувати_дитинчат_молоком(self):
        print('годує дитинчат молоком')

        
class жираф(ссавці):
    def їсти_листя_дерев(self):
        print('їсть листя дерев')
    def ліва_нога_вперед(self):
        print('ліва нога вперед')
    def ліва_нога_назад(self):
        print('ліва нога назад')
    def права_нога_вперед(self):
        print('ліва нога вперед')
    def права_нога_назад(self):
        print('права нога назад')
    def флекс(self):
        print('я ісполняю флекс!!!!')
    def танець(self):
        self.ліва_нога_вперед()
        self.ліва_нога_назад()
        self.права_нога_вперед()
        self.права_нога_назад()
        self.ліва_нога_вперед()
        self.ліва_нога_назад()
        self.права_нога_вперед()
        self.права_нога_назад()
        self.флекс()

        
class тигр(ссавці):
    def їсти_мясо(self):
        print('їсть мясо')
    def ходить_по_вольєру(self):
        print('прогулюється по вольєру')
    def випустить_кролика(self):
        print('охотиться за кроликом')
    def піймав_кролика(self):
        print('кролику пі**а')
   
